{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}, "input_2:0": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "4"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}, {"size": "4"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/MatMul_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}, {"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Relu_1", "op": "_FusedConv2D", "input": ["input_2", "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d/MaxPool", "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d/MaxPool_1", "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d_1/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_1/Relu_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d_1/MaxPool_1", "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_2/Relu"], "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/max_pooling2d_2/MaxPool_1", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_2/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/sequential_1/max_pooling2d_2/MaxPool_1", "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D_1/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_3/Relu", "StatefulPartitionedCall/model/sequential_1/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/sequential_1/conv2d_3/Relu_1", "StatefulPartitionedCall/model/sequential_1/flatten/Const_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/sequential_1/flatten/Reshape", "StatefulPartitionedCall/model/sequential_1/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/Relu_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/sequential_1/flatten/Reshape_1", "StatefulPartitionedCall/model/sequential_1/dense/MatMul_1/ReadVariableOp", "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/lambda/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/sequential_1/dense/Relu", "StatefulPartitionedCall/model/sequential_1/dense/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lambda/Abs", "op": "Abs", "input": ["StatefulPartitionedCall/model/lambda/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lambda/Abs", "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/Relu", "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_2/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of133.bin", "group1-shard2of133.bin", "group1-shard3of133.bin", "group1-shard4of133.bin", "group1-shard5of133.bin", "group1-shard6of133.bin", "group1-shard7of133.bin", "group1-shard8of133.bin", "group1-shard9of133.bin", "group1-shard10of133.bin", "group1-shard11of133.bin", "group1-shard12of133.bin", "group1-shard13of133.bin", "group1-shard14of133.bin", "group1-shard15of133.bin", "group1-shard16of133.bin", "group1-shard17of133.bin", "group1-shard18of133.bin", "group1-shard19of133.bin", "group1-shard20of133.bin", "group1-shard21of133.bin", "group1-shard22of133.bin", "group1-shard23of133.bin", "group1-shard24of133.bin", "group1-shard25of133.bin", "group1-shard26of133.bin", "group1-shard27of133.bin", "group1-shard28of133.bin", "group1-shard29of133.bin", "group1-shard30of133.bin", "group1-shard31of133.bin", "group1-shard32of133.bin", "group1-shard33of133.bin", "group1-shard34of133.bin", "group1-shard35of133.bin", "group1-shard36of133.bin", "group1-shard37of133.bin", "group1-shard38of133.bin", "group1-shard39of133.bin", "group1-shard40of133.bin", "group1-shard41of133.bin", "group1-shard42of133.bin", "group1-shard43of133.bin", "group1-shard44of133.bin", "group1-shard45of133.bin", "group1-shard46of133.bin", "group1-shard47of133.bin", "group1-shard48of133.bin", "group1-shard49of133.bin", "group1-shard50of133.bin", "group1-shard51of133.bin", "group1-shard52of133.bin", "group1-shard53of133.bin", "group1-shard54of133.bin", "group1-shard55of133.bin", "group1-shard56of133.bin", "group1-shard57of133.bin", "group1-shard58of133.bin", "group1-shard59of133.bin", "group1-shard60of133.bin", "group1-shard61of133.bin", "group1-shard62of133.bin", "group1-shard63of133.bin", "group1-shard64of133.bin", "group1-shard65of133.bin", "group1-shard66of133.bin", "group1-shard67of133.bin", "group1-shard68of133.bin", "group1-shard69of133.bin", "group1-shard70of133.bin", "group1-shard71of133.bin", "group1-shard72of133.bin", "group1-shard73of133.bin", "group1-shard74of133.bin", "group1-shard75of133.bin", "group1-shard76of133.bin", "group1-shard77of133.bin", "group1-shard78of133.bin", "group1-shard79of133.bin", "group1-shard80of133.bin", "group1-shard81of133.bin", "group1-shard82of133.bin", "group1-shard83of133.bin", "group1-shard84of133.bin", "group1-shard85of133.bin", "group1-shard86of133.bin", "group1-shard87of133.bin", "group1-shard88of133.bin", "group1-shard89of133.bin", "group1-shard90of133.bin", "group1-shard91of133.bin", "group1-shard92of133.bin", "group1-shard93of133.bin", "group1-shard94of133.bin", "group1-shard95of133.bin", "group1-shard96of133.bin", "group1-shard97of133.bin", "group1-shard98of133.bin", "group1-shard99of133.bin", "group1-shard100of133.bin", "group1-shard101of133.bin", "group1-shard102of133.bin", "group1-shard103of133.bin", "group1-shard104of133.bin", "group1-shard105of133.bin", "group1-shard106of133.bin", "group1-shard107of133.bin", "group1-shard108of133.bin", "group1-shard109of133.bin", "group1-shard110of133.bin", "group1-shard111of133.bin", "group1-shard112of133.bin", "group1-shard113of133.bin", "group1-shard114of133.bin", "group1-shard115of133.bin", "group1-shard116of133.bin", "group1-shard117of133.bin", "group1-shard118of133.bin", "group1-shard119of133.bin", "group1-shard120of133.bin", "group1-shard121of133.bin", "group1-shard122of133.bin", "group1-shard123of133.bin", "group1-shard124of133.bin", "group1-shard125of133.bin", "group1-shard126of133.bin", "group1-shard127of133.bin", "group1-shard128of133.bin", "group1-shard129of133.bin", "group1-shard130of133.bin", "group1-shard131of133.bin", "group1-shard132of133.bin", "group1-shard133of133.bin"], "weights": [{"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D/ReadVariableOp", "shape": [10, 10, 4, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D/ReadVariableOp", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/MatMul/ReadVariableOp", "shape": [16384, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/Conv2D_1/ReadVariableOp", "shape": [10, 10, 4, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d/BiasAdd_1/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/Conv2D_1/ReadVariableOp", "shape": [7, 7, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_1/BiasAdd_1/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/Conv2D_1/ReadVariableOp", "shape": [4, 4, 128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_2/BiasAdd_1/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/Conv2D_1/ReadVariableOp", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/conv2d_3/BiasAdd_1/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/flatten/Const_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/MatMul_1/ReadVariableOp", "shape": [16384, 4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/sequential_1/dense/BiasAdd_1/ReadVariableOp", "shape": [4096], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "shape": [4096, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "shape": [512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}